ChangeForDollar.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Multiplying Polynomials for Fun.</title>
<!-- 2017-12-23 Sat 00:29 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Josh Berry" />
<link rel="stylesheet" type="text/css" href="org-overrides.css" />
</head>
<body>
<div id="content">
<h1 class="title">Multiplying Polynomials for Fun.</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">Change for a dollar</a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Change for a dollar</h2>
<div class="outline-text-2" id="text-1">
<p>
For some reason, I thought the code to multiply two polynomials
would be interesting to implement.  To see if I did it right, I
opted to solve the "change for a dollar" question this way.
</p>

<p>
I went with the naive approach of using sequences of all
coefficients as the parameters.  My first run of this was in the
scratch buffer, so copied to here gives us the following.
</p>

<div class="org-src-container">

<pre class="src src-elisp" id="in-elisp">(<span style="color: #fa9a4b; font-weight: bold;">defun</span> <span style="color: #72aaca;">pmult</span> (as bs)
  (<span style="color: #fa9a4b; font-weight: bold;">let</span> ((c (min (length as)
                (length bs))))
    (<span style="color: #fa9a4b; font-weight: bold;">loop</span> for i from 0 to c
          collect (apply '+
                         (<span style="color: #fa9a4b; font-weight: bold;">loop</span> for j from 0 to i
                               collect (* (<span style="color: #fa9a4b; font-weight: bold;">or</span> (nth j as) 0)
                                          (<span style="color: #fa9a4b; font-weight: bold;">or</span> (nth (- i j) bs) 0)))))))

(<span style="color: #fa9a4b; font-weight: bold;">defun</span> <span style="color: #72aaca;">make-change-seq</span> (d l)
  (<span style="color: #fa9a4b; font-weight: bold;">loop</span> for i from 0 to l
        collect (<span style="color: #fa9a4b; font-weight: bold;">if</span> (<span style="color: #fa9a4b; font-weight: bold;">or</span> (eq 0 i)
                        (eq 0 (mod i d)))
                    1
                  0)))

(<span style="color: #fa9a4b; font-weight: bold;">defun</span> <span style="color: #72aaca;">change-for-amount</span> (a)
  (nth a (pmult (make-change-seq 50 a)
                (pmult (make-change-seq 25 a)
                       (pmult (make-change-seq 10 a)
                              (pmult (make-change-seq 5 a)
                                     (make-change-seq 1 a)))))))

(mapcar 'change-for-amount '(1 5 10 25 50 100 200 300 400 500))
</pre>
</div>

<p>
Executing the above will give us the expected answers.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="right" />

<col  class="right" />

<col  class="right" />

<col  class="right" />

<col  class="right" />

<col  class="right" />

<col  class="right" />

<col  class="right" />

<col  class="right" />

<col  class="right" />
</colgroup>
<tbody>
<tr>
<td class="right">1</td>
<td class="right">2</td>
<td class="right">4</td>
<td class="right">13</td>
<td class="right">50</td>
<td class="right">292</td>
<td class="right">2435</td>
<td class="right">9590</td>
<td class="right">26517</td>
<td class="right">59576</td>
</tr>
</tbody>
</table>

<p>
I'm new to actually writing elisp, so I suspect I could have done a
few things more cleanly.  Regardless, I'm happy with this as a rough
implementation.
</p>

<p>
I am curious to know if this is any better than the recursive
solution for this question.  Just at a glance, this is more work.
With how long this takes, I seem to recall that my last attempt at
this recursively was a bit faster.
</p>

<p>
I will note, however, that the closed form solution of this can
answer how many ways to make change for a million dollars instantly.
So, this seems a much better example for why you should used closed
form if you can.  (Though, I guess this is not that much less
artificial than the typical example of Fibonacci.)
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Josh Berry</p>
<p class="date">Created: 2017-12-23 Sat 00:29</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.2.2 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
